# This Notebook for pandas libraray basic

In [1]:
import pandas as pd
import numpy as np

In [2]:
#creating dataframe
data1=np.arange(0,20).reshape(5,4)

In [6]:
df=pd.DataFrame(data=data1,index=['row1','row2','row3','row4','row5'],columns=['col1','col2','col3','col4'])

In [7]:
df.head()

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [8]:
df.tail()  #printing last five

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [9]:
df.info()  # printing all information of columns

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, row1 to row5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int32
 1   col2    5 non-null      int32
 2   col3    5 non-null      int32
 3   col4    5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [11]:
df.describe()    #printing information like count mean std min max

            col1       col2       col3       col4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [12]:
#indexing  
#we use columns name ,rowindex[loc], rowindex 
#colmnsindex number
#1.by using name
df[['col1','col2']]

      col1  col2
row1     0     1
row2     4     5
row3     8     9
row4    12    13
row5    16    17

In [13]:
df['col1']

row1     0
row2     4
row3     8
row4    12
row5    16
Name: col1, dtype: int32

In [14]:
# 2.rowindexing
df.loc['row1']

col1    0
col2    1
col3    2
col4    3
Name: row1, dtype: int32

In [16]:
df.loc[['row3','row4','row5']]

      col1  col2  col3  col4
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [19]:
# 3columns indexing [.iloc]
df.iloc[2:4,0:2]
#where [x:y,a:b] is[start:end:step,start:end:step]

      col1  col2
row3     8     9
row4    12    13

In [28]:
#convert dataframe into array
p=np.array(df.iloc[2:4,0:2])

In [29]:
p

array([[ 8,  9],
       [12, 13]])

In [30]:
type(p)

numpy.ndarray

In [31]:
df

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [32]:
df.sum()

col1    40
col2    45
col3    50
col4    55
dtype: int64

### How I can read_csv() file and other separated values

In [3]:
import pandas as pd
from io import StringIO

In [4]:
df=pd.read_csv('locations.csv')

In [5]:
df.head()

,WBAN,NAME,STATE/COUNTRY ID,LAT,LON,ELEV,Latitude,Longitude
0,33013,AIN EL,AL,3623N,00637E,611,36.383333,6.650000
1,33031,LA SENIA,AL,3537N,00037E,88,35.616667,0.583333
2,33023,MAISON BLANCHE,AL,3643N,00314E,23,36.716667,3.216667
3,33044,TELERGMA,AL,3607N,00621E,754,36.116667,6.416667
4,12001,TINDOUF,AL,2741N,00809W,443,27.683333,-8.083333

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 161 entries, 0 to 160
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   WBAN              161 non-null    int64
 1   NAME              161 non-null    object
 2   STATE/COUNTRY ID  161 non-null    object
 3   LAT               161 non-null    object
 4   LON               161 non-null    object
 5   ELEV              161 non-null    int64
 6   Latitude          161 non-null    float64
 7   Longitude         161 non-null    float64
dtypes: float64(2), int64(2), object(4)
memory usage: 10.2+ KB

In [8]:
#creating csv file name text
data=('col1,col2,col3,col4\n'
      'x,y,z,a\n'
     '1,2,34,4\n'
     '4,5,3,5\n')

In [11]:
#string io is used for creating in memory objects (io)
StringIO(data)

In [14]:
df=pd.read_csv(StringIO(data))

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      object
 1   col2    3 non-null      object
 2   col3    3 non-null      object
 3   col4    3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

In [16]:
df.to_csv('test.csv')

In [18]:
#also we can change datatype while saving file 
df=pd.read_csv(StringIO(data),dtype={'x':int,'y':int})

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      object
 1   col2    3 non-null      object
 2   col3    3 non-null      object
 3   col4    3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes